# В масиві, який складається із n чисел:
# Перетворити масив таким чином, щоб спочатку були розташовані елементи, ціла частина яких, при діленні на 5
# не перевищувала одиниці, а потім всі інші. Розрахунок виконувати в одному масиві.

li = [7, 1, 2, 67, -3, 6, 0.25, 3, -4.52, 1, 2]


def division(l1):
    lis = []
    for num in l1:
        if (int(num) / 5) <= 1:
            lis.append(num)
    for el in l1:
        if (int(el) / 5) > 1:
            lis.append(el)
    return lis


print(division(li))
